# 控件颜色
class color():
    bg = '#c0d6cb'
    frame = '#e1e3e6'
    line = '#b3ffbc'
    bt = '#ededef'
    info = '#c70024'
mat = ('.jpg', ' .png',' .jpeg',' .mp4')
labermsg = '拖拽上传\n支持格式:'
mode = ('图片转txt', '图片转指定字符-jpg彩色', '图片转字符-jpg彩色','图片转字符-jpg指定颜色'
        ,'视频转指定字符-mp4彩色','视频转字符-mp4彩色','视频转字符-mp4指定颜色')
letter = ('!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/', '0', '1', '2',
          '3', '4', '5', '6', '7', '8', '9', ':', ';', '<', '=', '>', '?', '@', 'A', 'B', 'C', 'D',
          'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V',
          'W', 'X', 'Y', 'Z', '[', '\\', ']', '^', '_', '`', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h',
          'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
          '{', '|', '}', '~')
info = '''图片或者视频 通过该软件 可以转换成对应的 txt，jpg 格式的字符画，MP4 格式的字符视频
  图片转换时，界面会卡顿，表现为按钮按下去不会回弹，正常现象
  转换完成的图片视频在软件根目录
  视频转换请勿使用高分辨率，速度太慢，当然输入分辨率越高，转换后的分辨率也高
  参考 ： i5-7200u 实测 500x300 mp4, 每秒只能处理 1.5 帧'''

